"""
Задача 2: Найдите сумму цифр трехзначного числа.
*Пример:*
123 -> 6 (1 + 2 + 3)
100 -> 1 (1 + 0 + 0) 
"""
num = int(input("Введите трехзначное число:"))

res1 = num // 100
res2 = (num % 100)//10
res3 = num % 10

sum = res1+res2+res3

print(f'{res1}+{res2}+{res3} = {sum}')